app/views/rounds/index.html.erb

  <% @user.each do |user| %>
    <span style=color:#<%= Squad.where(:user => user).first.color unless Squad.where(:user => user).first == nil %>>
---
SELECT `squads`.* FROM `squads` WHERE `squads`.`user_id` = 1 ORDER BY id ASC LIMIT 1