app/views/planets/map.html.erb

    <% @routes.each do |route| %>
      <% @sensor = route if route.generic_fleets.any? { |fleet| fleet.is_a_sensor? && fleet.squad == @current_squad } %>
---
SELECT COUNT(*) FROM `generic_fleets` WHERE `generic_fleets`.`squad_id` = 1 AND (`generic_fleets`.planet_id = 31)

      <% resultados.sort_by{|a| [a.round.number, a.squad.name, a.generic_unit.id, a.quantity]}.each do |fleet| %>
      <% if fleet.round.number >= planet.results.maximum("round_id") and fleet.squad != @current_squad and planet.results.any? { |result| result.squad == @current_squad && result.round == fleet.round } %>
---
SELECT `results`.* FROM `results` WHERE (`results`.planet_id = 30)