app/controllers/facility_fleets_controller.rb

SELECT `planets`.* FROM `planets` WHERE `planets`.`id` = 10 ORDER BY name ASC LIMIT 1
---
  def edit
    @facility = FacilityFleet.find(params[:id])
    @units = Unit.allowed_for(current_squad.faction)
    @planet = @facility.planet
    unless @facility.producing_unit.present?

SELECT `planets`.* FROM `planets` WHERE `planets`.`id` = 10 ORDER BY name ASC LIMIT 1
---
  def find_resources
    @planet = Planet.find params[:planet_id]