app/controllers/generic_fleets_controller.rb

SELECT `squads`.* FROM `squads` WHERE (`squads`.user_id = 3) ORDER BY id ASC LIMIT 1
SELECT `squads`.* FROM `squads` WHERE `squads`.`id` = 1 ORDER BY id ASC LIMIT 1
---
  def index
    @planets = Planet.seen_by(current_squad)
    @round = Round.getInstance
    @squad = current_squad
    @all_squads = Squad.all
    @inactive = FacilityFleet.select { |facility| facility.squad == current_squad && facility.balance > 0 }