app/controllers/messages_controller.rb

SELECT `messages`.* FROM `messages`
SELECT `squads`.* FROM `squads` WHERE (`squads`.user_id = 3) ORDER BY id ASC LIMIT 1
---
  def index
    @current_squad = current_squad
    @messages = Message.all
    @message = Message.new
    @squads = Squad.all.reject! { |squad| squad == @current_squad }

INSERT INTO `messages` (`sender_id`, `receiver_id`, `title`, `body`, `created_at`, `updated_at`) VALUES (1, NULL, NULL, 'Olá pessoal\r\nHoje começamos nosso teste.\r\n', '2019-05-29 00:08:06', '2019-05-29 00:08:06')
---
  def create

    @message = Message.new(params[:message])

    respond_to do |format|
      if @message.save

SELECT `messages`.* FROM `messages` WHERE `messages`.`id` = 1 LIMIT 1
DELETE FROM `messages` WHERE `messages`.`id` = 1
---
  def deleta


    @message = Message.find(params[:id])
    @message.destroy