app/controllers/planets_controller.rb

  def show
    @planet = Planet.find(params[:id])
    GroupFleet.new(@planet).group!
    @setting = Setting.getInstance
    @round = Round.getInstance
    @squad = current_squad
    @map_ratio = ( @squad.map_ratio.to_f / 100 ).to_f
    redirect_to :controller => 'results', :action => 'index', :planet_id => @planet.id if @round.attack? && @planet.under_attack?


    @routes = @planet.routes
    @routes.each do |route|
      @sensor = route if route.generic_fleets.any? { |fleet| (fleet.type?(Sensor) && fleet.squad == current_squad) || (fleet.is_a_sensor? && fleet.squad == current_squad) }
---
SELECT `planets`.* FROM `planets` WHERE `planets`.`id` = 10 ORDER BY name ASC LIMIT 1
SELECT COUNT(*) AS count_all, squad_id AS squad_id FROM `generic_fleets` WHERE `generic_fleets`.`planet_id` = 10 GROUP BY squad_id ORDER BY squad_id ASC, moving ASC, destination_id ASC, generic_unit_id ASC, updated_at DESC
SELECT `generic_fleets`.* FROM `generic_fleets` WHERE (`generic_fleets`.planet_id = 28) ORDER BY squad_id ASC, moving ASC, destination_id ASC, generic_unit_id ASC, updated_at DESC
SELECT `squads`.* FROM `squads` WHERE (`squads`.user_id = 3) ORDER BY id ASC LIMIT 1

  def map
    @round = Round.getInstance
    @setting = Setting.getInstance
    @current_squad = current_squad
    @map_ratio = ( @current_squad.map_ratio.to_f / 100 ).to_f
    @planets = Planet.includes(:squad).all
    @all_squads = Squad.all
    @flee_tax = (@current_squad.flee_tax @round).to_i
    @ground_income = 0
    @air_income = 0
    Planet.includes(:squad).each do |planet|
      @air_income += (planet.air_credits(@current_squad) if planet.air_credits(@current_squad).present?).to_i
    end
    Planet.where(:ground_squad => @current_squad).each do |planet|
      @ground_income += (planet.ground_credits if planet.ground_credits.present?).to_i
---
SELECT `planets`.* FROM `planets` WHERE `planets`.`squad_id` = 2 ORDER BY name ASC
SELECT `squads`.* FROM `squads` WHERE (`squads`.user_id = 3) ORDER BY id ASC LIMIT 1
SELECT `planets`.* FROM `planets` WHERE `planets`.`ground_squad_id` = 2 ORDER BY name ASC
SELECT `rounds`.* FROM `rounds` ORDER BY rounds.id DESC LIMIT 1

    @commanders = 0
    @sensors = 0
    @miners = 0
    GenericFleet.where(:squad => @current_squad).each do |fleet|
---
SELECT `generic_fleets`.* FROM `generic_fleets` WHERE `generic_fleets`.`type` = 'FacilityFleet' AND (`generic_fleets`.planet_id = 5) ORDER BY squad_id ASC, moving ASC, destination_id ASC, generic_unit_id ASC, updated_at DESC