app/controllers/rounds_controller.rb

SELECT `squads`.* FROM `squads` ORDER BY id ASC
SELECT `users`.* FROM `users`
---
  def index
    @squads = Squad.all
    @user = User.all

INSERT INTO `rounds` (`number`, `move`, `attack`, `done`, `created_at`, `updated_at`) VALUES (1, 1, NULL, NULL, '2019-05-29 00:07:22', '2019-05-29 00:07:22')
INSERT INTO `squads` (`name`, `credits`, `created_at`, `updated_at`, `user_id`, `ready`, `color`, `faction`, `goal_id`, `home_planet_id`, `url`, `map_ratio`, `map_background`) VALUES ('Rebel', 1000, '2019-05-29 00:07:22', '2019-05-29 00:07:22', 3, NULL, 'FF0000', 1, 1, 5, NULL, 100, 1)
---
  def create_4_test_squads
    round = Round.getInstance.create_test_squads 4