app/controllers/settings_controller.rb

SELECT `settings`.* FROM `settings` LIMIT 1
---
  def index
    @settings = Setting.first